Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 伐木丁丁，鳥鳴嚶嚶。出自幽谷，遷于喬木。嚶其鳴矣，求其友聲。 相彼鳥矣，猶求友聲。矧伊人矣，不求友生。神之聽之，終和且平。 伐木許許，釃酒有藇。既有肥羜，以速諸父。寧適不來？微我弗顧。 於粲洒埽，陳饋八簋。既有肥牡，以速諸舅。寧適不來？微我有咎。 伐木于阪，釃酒有衍，籩豆有踐，兄弟無遠。民之失德，乾餱以愆。 有酒湑我，無酒酤我。坎坎鼓我，蹲蹲舞我。迨我暇矣！飲此湑矣！
en: On the trees go the blows kăng-kăng; And the birds cry out ying-ying. One issues from the dark valley, And removes to the lofty tree. Ying goes its cry, Seeking with its voice its companion. Look at the bird, Bird as it is, seeking with its voice its companion; And shall a man Not seek to have his friends? Spiritual beings will then hearken to him; He shall have harmony and peace.

source: 天保定爾，亦孔之固。俾爾單厚，何福不除？俾爾多益，以莫不庶。
en: Heaven protects and establishes thee, With the greatest security; Makes thee entirely virtuous. ​That thou mayest enjoy every happiness; Grants thee much increase, So that thou hast all in abundance.

source: 天保定爾，俾爾戩穀。罄無不宜，受天百祿。降爾遐福，維日不足。
en: Heaven protects and establishes thee. It grants thee all excellence, So that thine every matter is right, And thou receivest every Heavenly favour. It sends down to thee long-during happiness, Which the days are not sufficient to enjoy.

source: 天保定爾，以莫不興！如山如阜，如岡如陵。如川之方至，以莫不增。
en: Heaven protects and establishes thee, So that in everything thou dost prosper. Like the high hills and the mountain masses, Like the topmost ridges and the greatest bulks, Like the stream ever coming on, Such is thine increase.

source: 吉蠲為饎，是用孝享。禴祠烝嘗，于公先王。君曰卜爾，萬壽無疆！
en: With happy auspices and purifications thou bringest the offerings, And dost filially present them, In spring, summer, autumn, and winter, To the dukes and former kings; And they say, 'We give to thee myriads of years, duration unlimited.'

source: 神之弔矣，詒爾多福。民之質矣，日用飲食。羣黎百姓，徧為爾德。
en: The spirits come, And confer on thee many blessings. The people are simple and honest, Daily enjoying their meat and drink. All the black-haired race, in all their surnames, Universally practise thy virtue.

source: 如月之恆，如日之升。如南山之壽，不騫不崩。如松柏之茂，無不爾或承。
en: Like the moon advancing to the full, Like the sun ascending the heavens, Like the everlasting southern hills, Never waning, never falling, Like ​the luxuriance of the fir and the cypress;— May such be thy succeeding line!

source: 有杕之杜，有睆其實。王事靡盬，繼嗣我日。日月陽止，女心傷止，征夫遑止。 有杕之杜，其葉萋萋。王事靡盬，我心傷悲。卉木萋止，女心悲止，征夫歸止。 陟彼北山，言采其杞。王事靡盬，憂我父母。檀車幝幝，四牡痯痯，征夫不遠。 匪載匪來，憂心孔疚。期逝不至，而多為恤。卜筮偕止，會言近止，征夫邇止。
en: They have not packed up, they do not come. My sorrowing heart is greatly distressed. The time is past, and he is not here, To the multiplication of my sorrows. Both by the tortoise-shell and the reeds have I divined, And they unite in saying he is near. My warrior is at hand.

source: 魚麗于罶，鱨鯊。君子有酒，旨且多。 魚麗于罶，魴鱧。君子有酒，多且旨。 魚麗于罶，鰋鯉。君子有酒，旨且有。 物其多矣，維其嘉矣。 物其旨矣，維其偕矣。 物其有矣，維其時矣。
en: The fish lie in the basket, And the bream is in the pot. The lovely and virtuous lady — May there be to her spirits tranquillity and repose. The fish lie in the basket, And the tench and ide are in it. The lovely and virtuous lady — May there be to her plenty of repose. The fish lie in the basket, And the black skirts are in it. The lovely and virtuous lady — May there be to her rest in her apartment. The fish lie in the basket, And the salmon and hwang are in it. The lovely and virtuous lady — May there be to her congratulation from the spirits. The fish lie in the basket, And the bull-head and carp are in it. The lovely and virtuous lady — May there be to her bright fame from the spirits. The things in the basket are of dried grass; The things in the pot are of vegetables. The lovely and virtuous lady — May there be to her vigorous health from the spirits.

source: 南有嘉魚，烝然罩罩。君子有酒，嘉賓式燕以樂。 南有嘉魚，烝然汕汕。君子有酒，嘉賓式燕以衎。 南有樛木，甘瓠纍之。君子有酒，嘉賓式燕綏之。 翩翩者鵻，烝然來思。君子有酒，嘉賓式燕又思。
en: In the south are the barbel fish; The royal way is very easy. The gentleman goes to the banquet, There are admirable spirits and wine. In the south are the white bream; The royal way is very pure and good. The gentleman goes to the banquet, There are guests with lutes and drums. In the south are the trees of sapan wood; The royal way is very quiet and correct. The gentleman goes to the banquet, There are guests with lutes, bells, and drums. In the south are the trees of prickly ash; The royal way is very observant of duty. The gentleman goes to the banquet, There are guests with lutes, large and small.

source: 秩秩斯干，幽幽南山。如竹苞矣，如松茂矣。 兄及弟矣，式相好矣，無相猶矣。 似續妣祖，築室百堵。 西南其戶，爰居爰處，爰笑爰語。 約之閣閣，椓之橐橐。 風雨攸除，鳥鼠攸去，君子攸芋。 如跂斯翼，如矢斯棘。 如鳥斯革，如翬斯飛。君子攸躋。 殖殖其庭，有覺其楹。 噲噲其正，噦噦其冥。君子攸寧。 下莞上簟，乃安斯寢。乃寢乃興，乃占我夢。 吉夢維何？維熊維羆，維虺維蛇。 大人占之，維熊維羆，男子之祥。 維虺維蛇，女子之祥。 乃生男子，載寢之牀。載衣之裳，載弄之璋。 其泣喤喤，朱芾斯皇，室家君王。 乃生女子，載寢之地。載衣之裼，載弄之瓦。 無非無儀，唯酒食是議，無父母詒罹。
en: Level and smooth is the courtyard, And lofty are the pillars around it. Pleasant is the exposure of the chamber to the light, And deep and wide are its recesses. Here will our noble lord repose. On the rush-mat below and that of fine bamboos above it, May he repose in slumber! May he sleep ​and awake, (Saying), 'Divine for me my dreams. What dreams are lucky? They have been of bears and grisly bears; They have been of cobras and (other) snakes.' The chief diviner will divine them. 'The bears and grisly bears Are the auspicious intimations of sons; The cobras and (other) snakes Are the auspicious intimations of daughters.' Sons shall be born to him:— They will be put to sleep on couches; They will be clothed in robes; They will have sceptres to play with; Their cry will be loud. They will be (hereafter) resplendent with red knee-covers, The (future) king, the princes of the land. Daughters shall be born to him:— They will be put to sleep on the ground; They will be clothed with wrappers; They will have tiles to play with. It will be theirs neither to do wrong nor to do good. Only about the spirits and the food will ​they have to think, And to cause no sorrow to their parents.

source: 牧人乃夢，衆維魚矣。旐維旟矣，大人占之。 衆維魚矣，實維豐年。旐維旟矣，室家溱溱。
en: Your herdsmen shall dream, Of multitudes and then of fishes, Of the tortoise-and-serpent, and then of the falcon, banners. The chief diviner will divine the dreams;— How the multitudes, dissolving into fishes, Betoken plentiful years; How the tortoise-and-serpent, dissolving into the falcon, banners, Betoken the increasing population of the kingdom.

source: 節南山 節彼南山，維石巖巖。赫赫師尹，民具爾瞻。 憂心如惔，不敢戲談。國既卒斬，何用不監！
en: Lofty is that southern hill, With its masses of rocks! Awe-inspiring are you, O (Grand-)Master ​Yin, And the people all look to you! A fire burns in their grieving hearts; They do not dare to speak of you even in jest. The kingdom is verging to extinction;— How is it that you do not consider the state of things?

source: 節彼南山，有實其猗。赫赫師尹，不平謂何？ 天方薦瘥，喪亂弘多。民言無嘉，憯莫懲嗟。
en: Lofty is that southern hill, And vigorously grows the vegetation on it! Awe-inspiring are you, O (Grand-)Master Yin, But how is it that you are so unjust? Heaven is continually redoubling its inflictions; Deaths and disorder increase and multiply; No words of satisfaction come from the people; And yet you do not correct nor bemoan yourself.

source: 尹氏大師，維周之氐。秉國之均，四方是維。 天子是毗，俾民不迷。不弔昊天，不宜空我師。
en: The Grand-Master Yin Is the foundation of our Kâu, And the balance of the kingdom is in his hands. He should be keeping its four quarters together; He should be aiding the Son of Heaven, So as to preserve the people from going astray. O unpitying great Heaven, It is not right he should reduce us all to such misery!

source: 弗躬弗親，庶民弗信；弗問弗仕，勿罔君子？ 式夷式已，無小人殆。瑣瑣姻亞，則無膴仕。
en: He does nothing himself personally, And the people have no confidence in him. Making no enquiry about them, and no trial of their services, He should not deal deceitfully with superior men. If he dismissed them on the requirement of justice, Mean men would not be endangering (the commonweal); And his mean relatives Would not be in offices of importance.

source: 昊天不傭，降此鞠訩。昊天不惠，降此大戾。 君子如屆，俾民心闋。君子如夷，惡怒是違。
en: Great Heaven, unjust, Is sending down these exhausting disorders. Great Heaven, unkind, Is sending down these great miseries. Let superior men come (into office), And that would bring rest to the people's hearts. Let superior men execute ​their justice, And the animosities and angers would disappear.

source: 不弔昊天，亂靡有定。式月斯生，俾民不寧。 憂心如酲，誰秉國成？不自為政，卒勞百姓。
en: O unpitying great Heaven, There is no end to the disorder! With every month it continues to grow, So that the people have no repose. I am as if intoxicated with the grief of my heart. Who holds the ordering of the kingdom? He attends not himself to the government, And the result is toil and pain to the people.

source: 駕彼四牡，四牡項領。我瞻四方，蹙蹙靡所騁。
en: I yoke my four steeds, My four steeds, long-necked. I look to the four quarters (of the kingdom); Distress is everywhere; there is no place I can drive to.

source: 方茂爾惡，相爾矛矣。既夷既懌，如相醻矣。
en: Now your evil is rampant, And I can see your spears. Anon you are pacified and friendly as if you were pledging one another.

source: 昊天不平，我王不寧。不懲其心，覆怨其正。
en: From great Heaven is the injustice, And our king has no repose. (Yet) he will not correct his heart, And goes on to resent endeavours to rectify him.

source: 家父作誦，以究王訩。式訛爾心，以畜萬邦。
en: I, Kiâ-fû, have made this poem, To lay bare the king's disorders. If you would but change your heart, Then would the myriad regions be nourished.

source: 瞻彼中林，侯薪侯蒸。民今方殆，視天夢夢。 既克有定，靡人弗勝。有皇上帝，伊誰云憎？
en: Look into the middle of the forest; There are (only) large faggots and small branches in it. The people now amidst their perils Look to Heaven, all dark; But let its determination be fixed, And there is no one whom it will not overcome. There is the great God,— Does he hate any one?

source: 謂山蓋卑，為岡為陵。民之訛言，寧莫之懲！ 召彼故老，訊之占夢。具曰予聖，誰知烏之雌雄？
en: If one say of a hill that it is low, There are its ridges and its large masses. The false calumnies of the people,— How is it that you do not repress them? You call those experienced ancients, You consult the diviner of dreams. They all say, 'We are very wise, But who can distinguish the male and female crow?'

source: 瞻彼阪田，有菀其特。天之扤我，如不我克。 彼求我則，如不我得。執我仇仇，亦不我力。
en: Look at the rugged and stony field;— Luxuriantly rises in it the springing grain. (But) Heaven moves and shakes me, As if it could not overcome me. ​They sought me (at first) to be a pattern (to them), (Eagerly) as if they could not get me; (Now) they regard me with great animosity, And will not use my strength.

source: 十月之交，朔月辛卯。日有食之，亦孔之醜。 彼月而微，此日而微。今此下民，亦孔之哀。 日月告凶，不用其行。四國無政，不用其良。 彼月而食，則維其常。此日而食，于何不臧？ 爗爗震電，不寧不令。百川沸騰，山冡崒崩。 高岸為谷，深谷為陵。哀今之人，胡憯莫懲？ 皇父卿士，番維司徒。家伯維宰，仲允膳夫。 棸子內史，蹶維趣馬。楀維師氏，豔妻煽方處。 抑此皇父，豈曰不時？胡為我作，不即我謀？ 徹我牆屋，田卒汙萊。曰予不戕，禮則然矣！ 皇父孔聖，作都于向。擇三有事，亶侯多藏。 不憖遺一老，俾守我王。擇有車馬，以居徂向。 黽勉從事，不敢告勞。無罪無辜，讒口嚻嚻。 下民之孽，匪降自天。噂沓背憎，職競由人。 悠悠我里，亦孔之痗。四方有羨，我獨居憂。 民莫不逸，我獨不敢休。天命不徹，我不敢傚我友自逸。
en: At the conjunction (of the sun and moon) in the tenth month, On the first day of the moon, which was hsin-mâo, The sun was eclipsed, A thing of very evil omen. Before, the moon became small, And now the sun became small. Henceforth the lower people Will be in a very deplorable case. The sun and moon announce evil, Not keeping to their proper paths. Throughout the kingdom there is no (proper) government, Because the good are not employed. For the moon to be eclipsed Is but an ordinary matter. Now that the sun has been eclipsed,— How bad it is! Grandly flashes the lightning of the thunder. There is a want of rest, a want of good. The streams all bubble up and overflow. The crags on the hill-tops fall down. High banks become valleys; Deep valleys become hills. Alas for the men of this time! How does (the king) not stop these things? Hwang-fû is the President; Fan is the Minister ​of Instruction; Kiâ-po is the (chief) Administrator; Kung-yün is the chief Cook; Zâu is the Recorder of the Interior; Khwei is Master of the Horse; Yü is Captain of the Guards; And the beautiful wife blazes, now in possession of her place. This Hwang-fû Will not acknowledge that he is acting out of season. But why does he call us to move, Without coming and consulting with us? He has removed our walls and roofs; And our fields are all either a marsh or a moor. He says, 'I am not injuring you; The laws require that thus it should be.' Hwang-fû is very wise; He has built a great city for himself in Hsiang. He chose three men as his ministers, All of them possessed of great wealth. He could not bring himself to leave a single minister, Who might guard our king. He (also) selected those who had chariots and horses, To go and reside in Hsiang.

source: 浩浩昊天，不駿其德。降喪饑饉，斬伐四國。 旻天疾威，弗慮弗圖。舍彼有罪，既伏其辜。若此無罪，淪胥以鋪。 如何昊天，辟言不信？如彼行邁，則靡所臻。 凡百君子，各敬爾身。胡不相畏？不畏于天？
en: Great and wide Heaven, How is it you have contracted your kindness, Sending down death and famine, Destroying all through the kingdom? Compassionate Heaven, arrayed in terrors, How is it you exercise no forethought, no care? Let alone the criminals:— They have suffered for their guilt. But those who have no crime Are indiscriminately involved in ruin.

source: 旻天疾威，敷于下土，謀猶回遹，何日斯沮？ 謀臧不從，不臧覆用。我視謀猶，亦孔之卭。
en: The angry terrors of compassionate Heaven Extend through this lower world. (The king's) counsels and plans are crooked and bad; When will he stop (in his course)? Counsels that are good he will not follow, And those that are not good he employs. When I look at his counsels and plans, I am greatly pained.

source: 潝潝訿訿，亦孔之哀。謀之其臧，則具是違。 謀之不臧，則具是依。我視謀猶，伊于胡厎？
en: Now they agree, and now they defame one another;— The case is greatly to be deplored. If a counsel be good, They are all found opposing it. If a counsel be bad, They are all found according with it. When I look at such counsels and plans, What will they come to?

source: 我龜既厭，不我告猶。謀夫孔多，是用不集。 發言盈庭，誰敢執其咎？如匪行邁謀，是用不得于道。
en: Our tortoise-shells are wearied out, And will not tell us anything about the plans. The counsellors are very many, But on that account nothing is accomplished. The speakers fill the court, But ​who dares to take any responsibility on himself? We are as if we consulted (about a journey) without taking a step in advance, And therefore did not get on on the road.

source: 宛彼鳴鳩，翰飛戾天。我心憂傷，念昔先人。明發不寐，有懷二人。 人之齊聖，飲酒溫克。彼昏不知，壹醉日富。各敬爾儀，天命不又。
en: Small is the cooing dove, But it flies aloft to heaven. My heart is wounded with sorrow, And I think of our forefathers. When the dawn is breaking, and I cannot sleep, The thoughts in my breast are of our parents. Men who are grave and wise, Though they drink, are mild and masters of themselves; But those who are benighted and ignorant Become devoted to drink, and more so daily. Be careful, each of you, of your deportment; What Heaven confers, (when once lost), is not regained. The greenbeaks come and go, Picking up grain about the stackyard. Alas for the distressed and the solitary, Deemed fit inmates for the prisons! With a handful of grain I go out and divine, How I may be able to become good.

source: 弁彼鸒斯，歸飛提提。民莫不穀，我獨于罹。 何辜于天，我罪伊何？心之憂矣，云如之何。
en: With flapping wings the crows Come back, flying all in a flock. Other people are happy, And I only am full of misery. What is my offence against Heaven? What is my crime? My heart is sad;— What is to be done?

source: 維桑與梓，必恭敬止。靡瞻匪父，靡依匪母。 不屬于毛？不罹于裏？天之生我，我辰安在？
en: Even the mulberry trees and the rottleras Must be regarded with reverence; But no one is to be looked up to like a father, No one is to be depended on as a mother. Have I not a connexion with the hairs (of my father)? Did I not dwell in the womb (of my mother)? O Heaven, who gave me birth! How was it at so inauspicious a time?

source: 悠悠昊天，曰父母且。無罪無辜，亂如此幠。 昊天已威，予慎無罪。昊天大幠，予慎無辜。
en: O vast and distant Heaven, Who art called our parent, That, without crime or offence, I should suffer from disorders thus great! The terrors of great Heaven are excessive, But indeed I have committed no crime. (The terrors of) great Heaven are very excessive, But indeed I have committed no offence.

source: 驕人好好，勞人草草。蒼天蒼天！視彼驕人，矜此勞人！
en: The proud are delighted, And the troubled are in sorrow. O azure Heaven! O azure Heaven! Look on those proud men, Pity those who are troubled.

source: 彼譖人者，誰適與謀？取彼譖人，投畀豺虎。 豺虎不食，投畀有北。有北不受，投畀有昊。
en: Those slanderers! Who devised their schemes for them? I would take those slanderers, And throw them to wolves and tigers. If these refused to devour them, I would cast them into the north. If the north refused to receive them, I would throw them into the hands of great (Heaven).

source: 有饛簋飧，有捄棘匕。周道如砥，其直如矢。 君子所履，小人所視。睠言顧之，澘焉出涕。 小東大東，杼柚其空。糾糾葛屨，可以履霜。 佻佻公子，行彼周行。既往既來，使我心疚。 有洌氿泉，無浸穫薪。契契寤歎，哀我憚人。 薪是穫薪，尚可載也。哀我憚人，亦可息也。 東人之子，職勞不來。西人之子，粲粲衣服。 舟人之子，熊羆是裘。私人之子，百僚是試。 或以其酒，不以其漿。鞙鞙佩璲，不以其長。 維天有漢，監亦有光。跂彼織女，終日七襄。 雖則七襄，不成報章。睆彼牽牛，不以服箱。 東有啟明，西有長庚。有捄天畢，載施之行。 維南有箕，不可以簸揚。維北有斗，不可以挹酒漿。 維南有箕，載翕其舌。維北有斗，西柄之揭。
en: Well loaded with millet were the dishes, And long and curved were the spoons of thorn-wood. The way to Kâu was like a whetstone, And straight as an arrow. (So) the officers trod it, And the common people looked on it. When I look back and think of it, My tears run down in streams. In the states of the east, large and small, The looms are empty. Then shoes of dolichos fibre Are made to serve to walk on the hoar-frost. Slight and elegant gentlemen Walk along that road to Kâu. Their going and coming makes my heart sad. Ye cold waters, issuing variously from the spring, Do not soak the firewood I have cut. Sorrowful I awake and sigh;— Alas for us toiled people! The firewood has been cut;— Would that it were ​conveyed home! Alas for us the toiled people! Would that we could have rest! The sons of the east Are summoned only (to service), without encouragement; While the sons of the west Shine in splendid dresses. The sons of boatmen Have furs of the bear and grisly bear. The sons of the poorest families Form the officers in public employment. If we present them with spirits, They regard them as not fit to be called liquor. If we give them long girdle pendants with their stones, They do not think them long enough. There is the Milky Way in heaven, Which looks down on us in light; And the three stars together are the Weaving Sisters, Passing in a day through seven stages (of the sky). Although they go through their seven stages, They complete no bright work for us. Brilliant shine the Draught Oxen, But they do not serve to draw our carts. In the east there is Lucifer; In the west there is Hesperus; Long and curved ​is the Rabbit Net of the sky;— But they only occupy their places. In the south is the Sieve, But it is of no use to sift. In the north is the Ladle, But it lades out no liquor. In the south is the Sieve, Idly showing its mouth. In the north is the Ladle, Raising its handle in the west.

source: 明明上天，照臨下土。我征徂西，至于艽野。二月初吉，載離寒暑。 心之憂矣，其毒大苦。念彼共人，涕零如雨。豈不懷歸？畏此罪罟。
en: O bright and high Heaven, Who enlightenest and rulest this lower world! I marched on this expedition to the west, As far as this wilderness of Khiû. From the first day of the second month, I have passed through the cold and the heat. My heart is sad; The poison (of my lot) is too bitter. I think of those (at court) in their offices, And my tears flow down like rain. Do I not wish to return? But I fear the net for crime.

source: 嗟爾君子，無恆安處。靖共爾位，正直是與。神之聽之，式穀以女。
en: Ah! ye gentlemen, Do not reckon on your rest ​being permanent. Quietly fulfil the duties of your offices, Associating with the correct and upright; So shall the spirits hearken to you, And give you good.

source: 嗟爾君子，無恆安息。靖共爾位，好是正直。神之聽之，介爾景福。
en: Ah! ye gentlemen, Do not reckon on your repose being permanent. Quietly fulfil the duties of your offices, Loving the correct and upright; So shall the spirits hearken to you, And give you large measures of bright happiness.

source: 楚楚者茨，言抽其棘。自昔何為？我蓺黍稷。 我黍與與，我稷翼翼。我倉既盈，我庾維億。 以為酒食，以享以祀。以妥以侑，以介景福。 濟濟蹌蹌，絜爾牛羊，以往烝嘗。 或剝或亨，或肆或將，祝祭于祊。 祀事孔明，先祖是皇，神保是饗。 孝孫有慶，報以介福，萬壽無疆。 執爨踖踖，為俎孔碩，或燔或炙。 君婦莫莫，為豆孔庶，為賓為客。 獻醻交錯，禮儀卒度，笑語卒獲。 神保是格，報以介福，萬壽攸酢。 我孔熯矣，式禮莫愆。工祝致告，徂賚孝孫。 苾芬孝祀，神嗜飲食。卜爾百福，如幾如式。 既齊既稷，既匡既勑。永錫爾極，時萬時億。 禮儀既備，鍾鼓既戒。孝孫徂位，工祝致告。 神具醉止，皇尸載起。鼓鍾送尸，神保聿歸。 諸宰君婦，廢徹不遲。諸父兄弟，備言燕私。 樂具入奏，以綏後祿。爾殽既將，莫怨具慶。 既醉既飽，小大稽首。神嗜飲食，使君壽考。 孔惠孔時，維其盡之。子子孫孫，勿替引之。
en: Thick grew the tribulus (on the ground), But they cleared away its thorny bushes. Why did they this of old? That we might plant our millet and sacrificial millet; That our millet might be abundant, And our sacrificial millet luxuriant. When our barns are full, And our stacks can be counted by tens of myriads, We proceed to make spirits and prepared grain, For offerings and sacrifice. We seat the representatives of the dead, and urge them to eat:— Thus seeking to increase our bright happiness.

source: 信彼南山，維禹甸之。畇畇原隰，曾孫田之。我疆我理，南東其畝。
en: Yes, (all about) that southern hill Was made manageable by Yü. Its plains and marshes being opened up, It was made into fields by the distant descendant. We define their boundaries, We form their smaller divisions, And make the acres lie, here to the south, there to the east.

source: 上天同雲，雨雪雰雰。益之以霢霂，既優既渥。既霑既足，生我百穀。
en: The heavens overhead are one arch of clouds, Snowing in multitudinous flakes; There is superadded the drizzling rain. When (the land) has received the moistening, Soaking influence abundantly, It produces all our kinds of grain.

source: 疆埸翼翼，黍稷彧彧。曾孫之穡，以為酒食。畀我尸賓，壽考萬年。
en: The boundaries and smaller divisions are nicely adjusted, And the millets yield abundant crops, The harvest of the distant descendant. We proceed to make therewith spirits and food, To supply our representatives of the departed, and our guests;— To obtain long life, extending over myriads of years.

source: 中田有廬，疆埸有瓜。是剝是菹，獻之皇祖。曾孫壽考，受天之祜。
en: In the midst of the fields are the huts, And ​along the bounding divisions are gourds. The fruit is sliced and pickled, To be presented to our great ancestors, That their distant descendant may have long life, And receive the blessing of Heaven.

source: 祭以清酒，從以騂牡，享于祖考。執其鸞刀，以啟其毛，取其血膋。
en: We sacrifice (first) with clear spirits, And then follow with a red bull; Offering them to our ancestors, (Our lord) holds the knife with tinkling bells, To lay open the hair of the victim, And takes the blood and fat.

source: 是烝是享，苾苾芬芬。祀事孔明，先祖是皇。報以介福，萬壽無疆。
en: Then we present, then we offer; All round the fragrance is diffused. Complete and brilliant is the sacrificial service; Grandly come our ancestors. They will reward (their descendant) with great blessing, Long life, years without end.

source: 倬彼甫田，歲取十千。我取其陳，食我農人，自古有年。 今適南畝，或耘或耔。黍稷薿薿。攸介攸止，烝我髦士。
en: Bright are those extensive fields, A tenth of whose produce is annually levied. I take the old ​stores, And with them feed the husbandmen. From of old we have had good years; And now I go to the south-lying acres, Where some are weeding, and some gather the earth about the roots. The millets look luxuriant; And in a spacious resting-place, I collect and encourage the men of greater promise.

source: 以我齊明，與我犧羊，以社以方。 我田既臧，農夫之慶。琴瑟擊鼓，以御田祖。 以祈甘雨，以介我稷黍，以穀我士女。
en: With my vessels full of bright millet, And my pure victim-rams, We sacrificed at the altar of the spirits of the land, and at (the altars of those of the four) quarters. That my fields are in such good condition Is matter of joy to the husbandmen. With lutes, and with drums beating, We will invoke the Father of Husbandry, And pray for sweet rain, To increase the produce of our millets, And to bless my men and their wives.

source: 曾孫來止，以其婦子，饁彼南畝。 田畯至喜，攘其左右，嘗其旨否。 禾易長畝，終善且有。曾孫不怒，農夫克敏。
en: The distant descendant comes, When their wives and children Are bringing food to those (at work) in the south-lying acres. The surveyor of the fields (also) comes and is glad. He takes (of the food) on the left and the right, And tastes whether ​it be good or not. The grain is well cultivated, all the acres over; Good will it be and abundant. The distant descendant has no displacency; The husbandmen are encouraged to diligence.
